{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      "a": 4,
      "i": 5,
      "ː": 6,
      "l": 7,
      "t": 8,
      "f": 9,
      "w": 10,
      "s": 11,
      "u": 12,
      "b": 13,
      "ʔ": 14,
      "r": 15,
      "n": 16,
      "d": 17,
      "m": 18,
      "k": 19,
      "ˤ": 20,
      "j": 21,
      "q": 22,
      "ʕ": 23,
      "ħ": 24,
      "ʒ": 25,
      "ʃ": 26,
      "h": 27,
      "z": 28,
      "x": 29,
      "e": 30,
      "ɪ": 31,
      "ɣ": 32,
      "ð": 33,
      "ʊ": 34,
      "θ": 35,
      "͡": 36
    },
    "unk_token": "[UNK]"
  }
}