{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      "ل": 4,
      "ا": 5,
      "و": 6,
      "ف": 7,
      "ت": 8,
      "ي": 9,
      "ب": 10,
      "س": 11,
      "ن": 12,
      "ر": 13,
      "م": 14,
      "ك": 15,
      "د": 16,
      "أ": 17,
      "ق": 18,
      "ع": 19,
      "ح": 20,
      "ج": 21,
      "ش": 22,
      "ط": 23,
      "ه": 24,
      "ز": 25,
      "َ": 26,
      "ص": 27,
      "خ": 28,
      "غ": 29,
      "ض": 30,
      "ُ": 31,
      "ِ": 32,
      "إ": 33,
      "ْ": 34,
      "ث": 35,
      "ذ": 36,
      "ئ": 37,
      "ء": 38,
      "ّ": 39,
      "ظ": 40,
      "ٌ": 41,
      "ؤ": 42,
      "آ": 43,
      "ٍ": 44,
      "ى": 45,
      "ة": 46,
      "ً": 47
    },
    "unk_token": "[UNK]"
  }
}